Catalogs/ВычетыИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВычетыИПН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлениеВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредоставленияВычетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзносов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиСборыОтчисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПределВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыРасчетаВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВычетыИПН/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПредоставлениеВычетаПриИзменении(Элемент)
	
	Если Объект.ПредоставлениеВычета <> ПредопределенноеЗначение("Перечисление.ВидыПредоставленияВычетов.Стандартный") Тогда
		Объект.ПределВычета 		 = 0; 
		Объект.ПериодПредоставления = ПредопределенноеЗначение("Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца");
	КонецЕсли;	
	
	Если Объект.ПредоставлениеВычета <> ПредопределенноеЗначение("Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов") Тогда
		Объект.ВидВзносов = ПредопределенноеЗначение("Справочник.НалогиСборыОтчисления.ПустаяСсылка");	
	КонецЕсли;	
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьВидВзносов = Объект.ПредоставлениеВычета = ПредопределенноеЗначение("Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов");
	
	Элементы.ПериодПредоставления.Доступность 	= Объект.ПределВычета <> 0;
	Элементы.ВидВзносов.Видимость				= ВидимостьВидВзносов;		
	
	Если Не Форма.ТолькоПросмотр Тогда
		Форма.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПределВычетаПриИзменении(Элемент)
	
	Если Объект.ПределВычета = 0 Тогда
		Объект.ПериодПредоставления = ПредопределенноеЗначение("Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца");	
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры
